# DataFrames

DataFrame é o elemeto mais importante do Pandas e são diretamente inspirados pela linguagem de programação R. Podemos pensar em um DataFrame como um monte de objetos da série juntos para compartilhar o mesmo índice. Vamos usar Pandas para explorar esse tópico!

In [21]:
import pandas as pd
import numpy as np

In [22]:
from numpy.random import randn
np.random.seed(101)

In [23]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='C1 C2 C3 C4'.split())

In [24]:
df

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Seleção e indexação

Vamos aprender os vários métodos para pegar dados de um DataFrame

In [25]:
df['C1']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: C1, dtype: float64

In [29]:
# Sintaxe SQL (Não recomendado!)
df.C1

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: C1, dtype: float64

In [30]:
# Passando uma lista com nomes das colunas
df[['C1','C4']]

         C1        C4
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

As colunas dos DataFrames são Series

In [31]:
print(type(df[['C1']]))
print(type(df['C1']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

** Criando uma coluna: **

In [9]:
df['new'] = df['C1'] + df['C3']

In [10]:
df

         C1        C2        C3        C4       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

** Removendo colunas **

In [11]:
df.drop('new',axis=1)

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# Porém, tal exclusão só ocorrerá se especificada no parâmetro inplace
df

         C1        C2        C3        C4       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
df.drop('new',axis=1,inplace=True)

In [14]:
df

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Também podemos deletar colunas desta forma:

In [15]:
df.drop('E',axis=0)

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

** Selecionando linhas: **

In [16]:
df.loc['A']

C1    2.706850
C2    0.628133
C3    0.907969
C4    0.503826
Name: A, dtype: float64

Ou selecione com base na posição em vez do rótulo

In [17]:
df.iloc[2]

C1   -2.018168
C2    0.740122
C3    0.528813
C4   -0.589001
Name: C, dtype: float64

** Selecionando o subconjunto de linhas e colunas **

In [18]:
df.loc['B','C3']

-0.8480769834036315

In [19]:
df.loc[['A','B'],['C1','C3']]

         C1        C3
A  2.706850  0.907969
B  0.651118 -0.848077

### Seleção condicional

Uma característica importante dos pandas é a seleção condicional usando notação de colchetes, muito semelhante ao numpy:

In [20]:
df

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df>0

      C1     C2     C3     C4
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
df[df>0]

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df[df['C1']>0]

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[df['C1']>0]['C3']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: C3, dtype: float64

In [25]:
df[df['C1']>0][['C3','C2']]

         C3        C2
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

Para duas condições, você pode usar | e & com parênteses:

In [26]:
df[(df['C1']>0) & (df['C4'] > 1)]

Empty DataFrame
Columns: [C1, C2, C3, C4]
Index: []

## Mais Detalhes do Índice

Vamos discutir mais alguns recursos de indexação, incluindo resetar o índice ou configurá-lo de outra forma. Também falaremos sobre hierarquia de índice!

In [27]:
df

         C1        C2        C3        C4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Redefinir para o padrão 0,1 ... n índice
df.reset_index()

  index        C1        C2        C3        C4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [29]:
novoind = 'SC RS RJ SP PR'.split()

In [30]:
df['Estados'] = novoind

In [31]:
df

         C1        C2        C3        C4 Estados
A  2.706850  0.628133  0.907969  0.503826      SC
B  0.651118 -0.319318 -0.848077  0.605965      RS
C -2.018168  0.740122  0.528813 -0.589001      RJ
D  0.188695 -0.758872 -0.933237  0.955057      SP
E  0.190794  1.978757  2.605967  0.683509      PR

In [32]:
df.set_index('Estados')

               C1        C2        C3        C4
Estados
SC       2.706850  0.628133  0.907969  0.503826
RS       0.651118 -0.319318 -0.848077  0.605965
RJ      -2.018168  0.740122  0.528813 -0.589001
SP       0.188695 -0.758872 -0.933237  0.955057
PR       0.190794  1.978757  2.605967  0.683509

In [33]:
df

         C1        C2        C3        C4 Estados
A  2.706850  0.628133  0.907969  0.503826      SC
B  0.651118 -0.319318 -0.848077  0.605965      RS
C -2.018168  0.740122  0.528813 -0.589001      RJ
D  0.188695 -0.758872 -0.933237  0.955057      SP
E  0.190794  1.978757  2.605967  0.683509      PR

In [34]:
df.set_index('Estados',inplace=True)

In [35]:
df

               C1        C2        C3        C4
Estados
SC       2.706850  0.628133  0.907969  0.503826
RS       0.651118 -0.319318 -0.848077  0.605965
RJ      -2.018168  0.740122  0.528813 -0.589001
SP       0.188695 -0.758872 -0.933237  0.955057
PR       0.190794  1.978757  2.605967  0.683509

## Hierarquia de índices e índices múltiplos

Vamos examinar como trabalhar com o Multi-Index, primeiro criaremos um exemplo rápido de como seria um DataFrame Multi-Indexado:

In [36]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

Agora vamos mostrar como indexar isso! Para a hierarquia de índice, usamos df.loc []. Se este fosse no eixo das colunas, você usaria a notação de suporte normal df []. Chamar um nível do índice retorna um sub-dataframe:

In [66]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [67]:
df.loc['G1'].loc[1]

A   -1.467514
B   -0.494095
Name: 1, dtype: float64

In [68]:
df.index.names

FrozenList([None, None])

In [69]:
df.index.names = ['Grupo','Número']

In [70]:
df

                     A         B
Grupo Número
G1    1      -1.467514 -0.494095
      2      -0.162535  0.485809
      3       0.392489  0.221491
G2    1      -0.855196  1.541990
      2       0.666319 -0.538235
      3      -0.568581  1.407338

In [71]:
df.xs('G1')

               A         B
Número
1      -1.467514 -0.494095
2      -0.162535  0.485809
3       0.392489  0.221491

In [72]:
df.xs(['G1',1])

A   -1.467514
B   -0.494095
Name: (G1, 1), dtype: float64

In [73]:
df.xs(1,level='Número')

              A         B
Grupo
G1    -1.467514 -0.494095
G2    -0.855196  1.541990